---
kind: type
id: T:Autodesk.Revit.DB.RepeaterCoordinates
source: html/17102857-7a63-7039-f5f4-88d07dc33c7a.htm
---
# Autodesk.Revit.DB.RepeaterCoordinates

Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.

## Syntax (C#)
```csharp
public class RepeaterCoordinates : IDisposable
```